node {
  name: "dropout_keep_rate"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "sample_loss_weights/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 200
          }
        }
        tensor_content: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
    }
  }
}
node {
  name: "sample_loss_weights"
  op: "PlaceholderWithDefault"
  input: "sample_loss_weights/input"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/dropout_keep_rate"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/source_token"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/target_token"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/path"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout_keep_rate"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/source_token"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/target_token"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 200
        }
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\240\206\001\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.007736071012914181
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.007736071012914181
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 14
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/max"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/mul"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform"
  op: "Add"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100000
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Assign"
  op: "AssignVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\240\206\001\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.007736071012914181
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.007736071012914181
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 25
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/max"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/mul"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform"
  op: "Add"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100000
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Assign"
  op: "AssignVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\003\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.08833085745573044
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.08833085745573044
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 36
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/max"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/mul"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform"
  op: "Add"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 768
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Assign"
  op: "AssignVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup"
  op: "ResourceGather"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/source_token"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "batch_dims"
    value {
      i: 0
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup/Identity"
  op: "Identity"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup/Identity_1"
  op: "Identity"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_1"
  op: "ResourceGather"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/path"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
  attr {
    key: "batch_dims"
    value {
      i: 0
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_1/Identity"
  op: "Identity"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/path_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_1/Identity_1"
  op: "Identity"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_1/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_2"
  op: "ResourceGather"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/target_token"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
  attr {
    key: "batch_dims"
    value {
      i: 0
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_2/Identity"
  op: "Identity"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/token_embeddings"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_2/Identity_1"
  op: "Identity"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_2/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat"
  op: "ConcatV2"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup/Identity_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_1/Identity_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/embedding_lookup_2/Identity_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/sub/x"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout_keep_rate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/Shape"
  op: "Shape"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 60
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/max"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/mul"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform"
  op: "Add"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/sub/x"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/truediv/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/truediv"
  op: "RealDiv"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/truediv/x"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/GreaterEqual"
  op: "GreaterEqual"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/random_uniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/mul"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/Cast"
  op: "Cast"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/GreaterEqual"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/mul_1"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\000\003\000\000"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape"
  op: "Reshape"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/dropout/mul_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\003\000\000\000\003\000\000"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0625
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0625
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 77
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/sub"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/max"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/mul"
  op: "Mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/RandomUniform"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform"
  op: "Add"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/mul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 768
        }
        dim {
          size: 768
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Assign"
  op: "AssignVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/TRANSFORM"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul"
  op: "MatMul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Tanh"
  op: "Tanh"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/ATTENTION"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul_1"
  op: "MatMul"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Tanh"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul_1/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\377\377\377\377\310\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape_1"
  op: "Reshape"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/MatMul_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_1"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Rank_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range/limit"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range"
  op: "Range"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range/start"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range/limit"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_1"
  op: "Range"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_1/start"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1/values_1"
  op: "Pack"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_1"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1/values_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1"
  op: "ConcatV2"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1/values_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1/values_3"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 4
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/transpose"
  op: "Transpose"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Reshape_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/concat_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Softmax"
  op: "Softmax"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_2"
  op: "Sub"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Rank_1"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/Sub_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2/limit"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2"
  op: "Range"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2/start"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2/limit"
  input: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "code_encoder/java/code2vec_encoder/code2vec_encoder/range_3/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
